{
  "AI": "Hello, this is an automated system calling on behalf of {therapist_name} to verify patient eligibility and benefits. May I speak with a representative, please?",
  "Payer": "This is {representative_name}. How can I assist you today?",
  "AI": "Thank you, {representative_name}. I'm calling to verify insurance coverage and benefits for a patient. I have their insurance card information. May I proceed?",
  "Payer": "Yes, go ahead.",
  "AI": "Great, thank you. The patient's name is {patient_name}, date of birth {dob}, and their insurance ID is {insurance_id}. Can you confirm this information is correct?",
  "Payer": "Yes, I've located the patient's information. What would you like to know?",
  "AI": "Thank you. First, I'd like to confirm that the patient's insurance is active and covers mental health services.",
  "Payer": "Yes, the insurance is active and does cover mental health services.",
  "AI": "Excellent. Can you please tell me the patient's copay for therapy sessions and their current deductible status?",
  "Payer": "The copay for therapy sessions is ${copay_amount}, and the patient has met ${deductible_met} of their ${deductible_total} deductible.",
  "AI": "Thank you. Is pre-authorization required for therapy services?",
  "Payer": "No, pre-authorization is not required for standard therapy services.",
  "AI": "Great. Can you confirm if {therapist_name} is in-network with this insurance plan?",
  "Payer": "Yes, {therapist_name} is in-network with this plan.",
  "AI": "Thank you. How many therapy sessions are covered per year, and how many does the patient have remaining?",
  "Payer": "The plan covers {total_sessions} therapy sessions per year, and the patient has {remaining_sessions} remaining.",
  "AI": "Excellent. Can you confirm the correct procedure for submitting claims?",
  "Payer": "Claims should be submitted electronically using {submission_process}.",
  "AI": "Understood. What is the reimbursement rate for a standard 60-minute therapy session?",
  "Payer": "The reimbursement rate for a 60-minute therapy session is ${reimbursement_rate}.",
  "AI": "Thank you. Are there any specific documentation requirements for claims submission?",
  "Payer": "Standard claims require a diagnosis code and CPT code. No additional documentation is needed unless requested.",
  "AI": "Great, thank you for all this information. Is there a reference number for this call that I can note for our records?",
  "Payer": "Yes, the reference number for this call is {reference_number}.",
  "AI": "Thank you, {representative_name}. You've been very helpful. Is there anything else I should know about this patient's coverage?",
  "Payer": "No, that covers everything. Is there anything else you need assistance with?",
  "AI": "No, that's all for now. Thank you for your time and assistance. Have a great day!",
  "Payer": "You're welcome. Have a great day as well."
}
